# parameters
nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors: # 512 --
  - [ 10,13, 16,30, 33,23 ]  # P3/8
  - [ 30,61, 62,45, 59,119 ]  # P4/16
  - [ 116,90, 156,198, 373,326 ]  # P5/32


# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, CBH, [32, 3, 2]],  # 0-P1/2

   [ -1, 1, LC_Block, [ 64, 2, 3, False ] ], # 1-P2/4
   [ -1, 1, LC_Block, [ 64, 1, 3, False ] ], # 2
   [ -1, 1, LC_Block, [ 128, 2, 3, False ] ], # 3-P3/8
   [ -1, 1, LC_Block, [ 128, 1, 3, False ] ], # 4
   [ -1, 1, LC_Block, [ 128, 1, 3, False ] ], # 5
   [ -1, 1, LC_Block, [ 128, 1, 3, False ] ], # 6-P3/8
   [ -1, 1, LC_Block, [ 256, 2, 3, False ] ], # 7-P4/16
   [ -1, 1, LC_Block, [ 256, 1, 5, False ] ],
   [ -1, 1, LC_Block, [ 256, 1, 5, False ] ],
   [ -1, 1, LC_Block, [ 256, 1, 5, False ] ], # 10
   [ -1, 1, LC_Block, [ 256, 1, 5, False ] ],
   [ -1, 1, LC_Block, [ 256, 1, 5, False ] ], # 12-P4/16
   [ -1, 1, LC_Block, [ 512, 2, 5, True ] ],  #13-p5/32
   [ -1, 1, LC_Block, [ 512, 1, 5, True ] ], # 14-P5/32
   [ -1, 1, LC_Block, [ 512, 1, 5, True ] ], # 15
   [ -1, 1, LC_Block, [ 512, 1, 5, True ] ], # 16
   [ -1, 1, Dense, [ 512, 1, 0.2 ] ], #17
  ]

# yolov7-tiny head
head:
  [[-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],#18 SPPCSP start
   [-2, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, SP, [5]],
   [-2, 1, SP, [9]],
   [-3, 1, SP, [13]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, -7], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 26 end

   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 12], 1, Concat, [1]],                  #route backbone p4

   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-2, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 35

   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],                   # route backbone P3

   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-2, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 44(P3/8)

   [ -1, 1, LC_Block, [ 128, 2, 5, True ] ],
   [[-1, 35], 1, Concat, [1]],                          #cat head p4

   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-2, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 52(P4/16)

   [ -1, 1, LC_Block, [ 256, 2, 5, True ] ], # 53
   [ [-1, 27], 1, Concat, [1]],                          #cat head p5

   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-2, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [256, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [256, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 60(P5/32)

   [[44, 52, 60], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
